# Parameter Type Id Rebar Shape Type At Start Property

Source: https://www.revitapidocs.com/2026/434d30e9-1e1d-7435-6ae0-34d9b949c6b7.htm

---

| Parameter Type Id Rebar Shape Type At Start Property |
| --- |

"Type At Start"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeTypeAtStart { get; }
```

```
Public Shared ReadOnly Property RebarShapeTypeAtStart As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeTypeAtStart {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeTypeAtStart : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace